app/controllers/posts/comments_controller.rb

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 3
---
  def index
    @comments = Comment.where(post_id: params[:post_id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 ORDER BY `users`.`id` ASC LIMIT 1
---
  def show
    @commentuser = User.find_by(id: @comment.user_id)

INSERT INTO `comments` (`body`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES ('lll', 6, 3, '2018-10-22 18:35:25', '2018-10-22 18:35:25')
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    if @comment.save

UPDATE `comments` SET `body` = 'to mom2 come3 edit\r\n\r\n', `updated_at` = '2018-11-01 08:11:24' WHERE `comments`.`id` = 4
---
  def update
    if @comment.update(comment_params)