app/views/posts/comments/index.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 3
SELECT COUNT(*) FROM `fav_comments` WHERE `fav_comments`.`comment_id` = 7
---
        <td><%= comment.body %></td>
        <% if @user.fav_comments.where(comment_id: comment.id).exists?%>
        <%= "いいね#{comment.fav_comments.count}件" %>