sns1/app/controllers/api/posts_controller.rb

  def create
    post = @user.posts.create!(body: post_params[:body], trans: post_params[:trans])
---
INSERT INTO `posts` (`body`, `trans`, `user_id`, `created_at`, `updated_at`) VALUES ('tamago', 1, 6, '2018-12-25 11:39:53', '2018-12-25 11:39:53')