app/views/posts/index.html.erb

        <td><%= post.body %></td>
        <td><%= "いいね#{post.fav_posts.count}件" %></td>
---
SELECT `posts`.* FROM `posts`