app/controllers/fav_comments_controller.rb

  def create
    @favcount = 0
    @favs = FavComment.where(comment_id: set_comment[:id])
    @favcount = @favs.count
---
SELECT COUNT(*) FROM `fav_comments` WHERE `fav_comments`.`comment_id` IS NULL