app/controllers/fav_comments_controller.rb

  def create
    @comments = Comment.where(id: @comment.id)
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1