app/controllers/fav_posts_controller.rb

  def create
    favs = FavPost.where(post_id: @post.id)
    favcount = favs.count
    if favs.where(user_id: @user.id).nil?
      @fav = FavPost.create(user_id: current_user.id,
                            post_id: params[:id])
---
SELECT COUNT(*) FROM `fav_posts` WHERE `fav_posts`.`post_id` = 4
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
INSERT INTO `fav_posts` (`user_id`, `post_id`, `created_at`, `updated_at`) VALUES (6, 4, '2018-10-23 08:47:12', '2018-10-23 08:47:12')

  def destroy
    favs = FavPost.where(post_id: @post.id)
    favcount = favs.count
---
SELECT COUNT(*) FROM `fav_posts` WHERE `fav_posts`.`post_id` = 1