app/controllers/fav_comments_controller.rb

  def create
    @post = Post.find_by(id: params[:post])
    @comments = Comment.where(post_id: params[:post])
    if @favcount == 0
      @fav = FavComment.create(user_id: current_user.id,
                               comment_id: params[:comment])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `fav_comments` (`user_id`, `comment_id`, `created_at`, `updated_at`) VALUES (6, 1, '2018-10-23 07:27:25', '2018-10-23 07:27:25')

  def exist_comment
    @favcount = 0
    @favs = FavComment.where(comment_id: params[:comment])
    @favcount = @favs.count
---
SELECT COUNT(*) FROM `fav_comments` WHERE `fav_comments`.`comment_id` = 1