app/controllers/follows_controller.rb

    def index
        #自分をfollowしているfollower一覧
        #@followed= User.eager_load(:follows).where("followed <= ?", current_user.id )
        @users = User.all
        @followids=Follow.where(follower: current_user.id)
        if @followids.any?
            @followids.each do |f|
                if @followers!=nil
                    @followers + [User.where(id: f.follower)]
                else
                    @followers = User.where(id: f.follower)
---
SELECT `users`.* FROM `users`
SELECT `follows`.`id` FROM `follows` WHERE `follows`.`follower` = 2
SELECT  1 AS one FROM `follows` WHERE `follows`.`follower` = 2 LIMIT 1
SELECT `follows`.* FROM `follows` WHERE `follows`.`follower` = 2
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2

    def create
        @follow = Follow.create(follower: current_user.id,followed: params[:followed])
---
INSERT INTO `follows` (`follower`, `followed`, `created_at`, `updated_at`) VALUES (2, 1, '2018-11-01 08:45:34', '2018-11-01 08:45:34')

    def check_follow
        #自分だけでなくて相手からもfollowされているか確認
        check=Follow.find_by(followed: current_user.id, follower: params[:id])
        if check!=nil
            @follower = User.where(id: params[:id])
---
SELECT  `follows`.* FROM `follows` WHERE `follows`.`followed` = 2 AND `follows`.`follower` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1