app/controllers/follows_controller.rb

INSERT INTO `follows` (`follower`, `followed`, `created_at`, `updated_at`) VALUES (3, 3, '2018-11-01 15:08:33', '2018-11-01 15:08:33')
---
  def create
    @follow = Follow.create(follower: current_user.id, followed: params[:followed])

SELECT  `follows`.* FROM `follows` WHERE `follows`.`follower` = 3 AND `follows`.`followed` = 2 LIMIT 1
DELETE FROM `follows` WHERE `follows`.`id` = 3
---
  def destroy
    @follow = Follow.find_by(follower: current_user.id, followed: params[:followed])
    if @follow.destroy