app/controllers/homes_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 11 ORDER BY `users`.`id` ASC LIMIT 1
---
  def mypage
    @pageuser =
      if get_params[:id] != nil
        User.find_by(id: get_params[:id])