app/controllers/home_controller.rb

    def mypage
      @mypost = Post.where(user_id: current_user.id)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 7