app/controllers/homes_controller.rb

  def index
    @posts = Post.where(trans: 1)
    #@posts = Post.eager_load(users: :settings).where(settings: {public_degree: 1})
    #@posts = Post.where(user_id: )
    #@user = User.eager_load(:settings).where(settings: {public_degree: 1})
    @settings = Setting.where(public_degree: 1)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`trans` = 1
SELECT `settings`.* FROM `settings` WHERE `settings`.`public_degree` = 1

  def mypage
    @mypost = Post.where(user_id: current_user.id)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 11

    def set_follower
      @followers=Follow.where(followed: current_user.id)
      #@posts = Post.eager_load(users:)
      @followers.each do |f|
        if @f_posts == nil
          @f_posts = Post.where(user_id: f.follower)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = 11 ORDER BY `posts`.`id` ASC LIMIT 1