app/controllers/posts_controller.rb

  def show
    @postuser = User.find_by(id: @post.user_id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 8 LIMIT 1

  def create
    Post.transaction do
      @post = Post.create!(title: post_params[:title], body: post_params[:body],
                           trans: post_params[:trans], user_id: current_user.id)
---
INSERT INTO `posts` (`title`, `body`, `user_id`, `created_at`, `updated_at`) VALUES ('mondayつくりすぎ', 'でもよき', 10, '2018-10-27 18:16:36', '2018-10-27 18:16:36')

  def set_post
    @post = Post.find_by(id: params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1