app/controllers/posts_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1
---
  def show
    #@images = Image.where(post_id: params[:id])
    @postuser = User.find_by(id: @post.user_id)