app/controllers/users_controller.rb

    def index
        @friend = []#follow at each other
        @followed =[]#only followed by the login user
        @nonfollowed = []#only follow the login user
        @stranger = [] #not follow at each other
        @users = User.all
        @users.each do |person|
---
SELECT `users`.* FROM `users`

    def show
        @follower = User.find_by(id: params[:id])
        @f_posts = Post.where(user_id: params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 3