app/controllers/users/profiles_controller.rb

INSERT INTO `profiles` (`nickname`, `picture`, `created_at`, `updated_at`, `user_id`) VALUES ('momomo', 'icon.png', '2018-10-27 18:30:17', '2018-10-27 18:30:17', 10)
---
    def create
        @profile = Profile.new(profile_params)
        @profile.user_id = current_user.id
        @user=current_user
        if @profile.save

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` IS NULL LIMIT 1
---
        def set_profile
            @profile = Profile.find(params[:id])