app/controllers/users/settings_controller.rb

  def create
    @setting = Setting.new(setting_params)
    @setting.user_id = current_user.id
    if @setting.save
---
INSERT INTO `settings` (`user_id`, `public_degree`, `created_at`, `updated_at`) VALUES (11, 1, '2018-10-27 15:24:10', '2018-10-27 15:24:10')